"use strict";
use('Test');
var testAnx = db.getCollection("Test").findOne({ title: "anxiety" });
var testDep = db.getCollection("Test").findOne({ title: "depression" });
var questionsAnxiety = db.getCollection("Question").find({ testId: testAnx["_id"] }).toArray();
var questionsDepression = db.getCollection("Question").find({ testId: testDep["_id"] }).toArray();
db.getCollection("Option").deleteMany({});
for (var i = 0; i < questionsAnxiety.length; i++) {
    db.getCollection("Option").insertMany([
        {
            text_kz: "Болған жоқ",
            text_ru: "Нисколько",
            points: 0,
            questionId: questionsAnxiety[i]["_id"]
        },
        {
            text_kz: "Аздап(Бұл мені қатты мазалағагн жоқ)",
            text_ru: "Слегка(Это меня сильно не беспокоило)",
            points: 1,
            questionId: questionsAnxiety[i]["_id"]
        },
        {
            text_kz: "Орташа(Жағымсыз болғанымен, бірақ бұған шыдау мүмкін)",
            text_ru: "Умеренно(Это было не приятно, но терпимо)",
            points: 2,
            questionId: questionsAnxiety[i]["_id"]
        },
        {
            text_kz: "Қатты(Бұған шыдау мүмкін емес)",
            text_ru: "Сильно(Это было невыносимо)",
            points: 3,
            questionId: questionsAnxiety[i]["_id"]
        },
    ]);
}
var questionLang = db.getCollection("Question").findOne({ text_ru: "Выберите язык" });
var questionSurveyType = db.getCollection("Question").findOne({ text_ru: "Выберите вид анкетирования" });
db.getCollection("Option").insertMany([
    {
        text: "Русский",
        points: 0,
        questionId: questionLang["_id"]
    },
    {
        text: "Қазақша",
        points: 0,
        questionId: questionLang["_id"]
    },
    {
        text_kz: "Мазасыздық",
        text_ru: "Тревожность",
        points: 0,
        questionId: questionSurveyType["_id"]
    },
    {
        text_kz: "Депрессия",
        text_ru: "Депрессия",
        points: 0,
        questionId: questionSurveyType["_id"]
    }
]);
var options = [
    {
        "question": "Печаль",
        "answers": [
            "Мне не грустно",
            "Мне грустно большую часть времени",
            "Мне все время грустно",
            "Я настолько несчастна и опечалена, что не могу этого вынести"
        ],
        "answers_kz": [
            "Менің қайғым жоқ",
            "Мен көбіне қайғырамын",
            "Мен әрдайым қайғырып тұрамын",
            "Менің бақытсыз әрі қайғылы екнім соншалықты, одан әрі шыдау мүмкін емес"
        ]
    },
    {
        "question": "Пессимизм",
        "answers": [
            "Я не тревожусь о своем будущем",
            "Я тревожусь о будущем больше, чем раньше",
            "Я не ожидаю, что у меня все получится",
            "Мне кажется, что все безнадежно, и будет только хуже"
        ],
        "answers_kz": [
            "Мен өзімді сәтсіз адам деп есптемеймін",
            "Негізінде сәтсіздіктер аздау болуы да мүмкін еді",
            "Өткенімді саралап, бірқатар сәтсіздіктерді бастан кешіргенімді көремін",
            "Мен жеке тұлға ретінде қалыптаса алмадым"
        ]
    },
    {
        "question": "Оценка прошлого",
        "answers": [
            "Я не считаю себя неудачником",
            "Провалов могло бы быть и меньше",
            "Оглядываясь назад, я вижу череду неудач",
            "Я чувствую, что я не состоялась как личность"
        ],
        "answers_kz": [
            "Мен өзімді сәтсіз адам деп есптемеймін",
            "Негізінде сәтсіздіктер аздау болуы да мүмкін еді",
            "Өткенімді саралап, бірқатар сәтсіздіктерді бастан кешіргенімді көремін",
            "Мен жеке тұлға ретінде қалыптаса алмадым",
        ]
    },
    {
        "question": "Потеря удовлетворения",
        "answers": [
            "Я наслаждаюсь жизнью и всем что меня окружает, как и прежде",
            "Все что радовало меня раньше, сейчас радует меня меньше",
            "Я получаю очень мало удовольствия от вещей, которыми раньше наслаждалась",
            "Я не могу получить никакого удовольствия от вещей, которыми раньше наслаждалась"
        ],
        "answers_kz": [
            "Маған өмір мен айналамдағылардың бәрі бұрынғыдай ұнайды",
            "Бұрын маған ұнайтын нәрселердің бәрі енді мені азырақ қызықтырады",
            "Бұрын маған ұнайтын нәрселердің бәрі енді мені мүлдем қызықтырмай қалды",
            "Мен бұрын ұнатқан нәрселерден рақат ала алмаймын.",
        ]
    },
    {
        "question": "Чувство вины",
        "answers": [
            "Меня не мучает чувство вины",
            "Меня иногда посещает чувство вины, за то, что я сделала или должна была сделать",
            "Я чувствую себя виноватой большую часть времени",
            "Я всегда чувствую себя виноватой"
        ],
        "answers_kz": [
            "Мен өзімді кінәлі сезінбеймін",
            "Кейде мен жасаған іс-әрекеттерім үшін немесе оларды жасауға міндетті болғаным үшін өзімді кінәлі сезінемін",
            "Мен өзімді көбіне кінәлі сезінемін",
            "Мен әрқашан өзімді кінәлі сезінемін",
        ]
    },
    {
        "question": "Чувство наказания",
        "answers": [
            "Мне не кажется, что меня наказывают",
            "Я чувствую, что могу быть наказана",
            "Я ожидаю наказания",
            "Я чувствую, что меня наказывают"
        ],
        "answers_kz": [
            "Мен өзімді жазаланғандай сезінбеймін ",
            "Мені жазалауы мүмкін екендігін түсінемін",
            "Мен өзімнің жазалануымды күтемін",
            "Мен өзімнің жазаланғанымды сезінемін",
        ]
    },
    {
        "question": "Нелюбовь к себе",
        "answers": [
            "Я отношусь к себе так же, как и прежде",
            "Я потеряла уверенность в себе",
            "Я разочарован в себе и своих возможностях",
            "Я ненавижу себя и не вижу в себе ничего хорошего"
        ],
        "answers_kz": [
            "Менің өзіме деген арақатынасым бұрынғыдай ",
            "Мен өзіме деген сенімділікті жоғалттым",
            "Менің өзімнен көңілім қалды",
            "Мен өзімді ұнатпаймын  (жақсы көрмеймін)",
        ]
    },
    {
        "question": "Самокритика",
        "answers": [
            "Я не критикую себя",
            "Я критикую себя больше, чем раньше",
            "Я критикую себя за все свои недостатки",
            "Я виню себя за все плохое, что происходит вокруг"
        ],
        "answers_kz": [
            "Мен өзімді сынамаймын",
            "Мен өзімді бұрынғыдан көп сынаймын",
            "Мен барлық кемшіліктерім үшін өзімді қатты сынаймын",
            "Мен айналамызда болып жатқан барлық жаман істер үшін өзімді кінәлаймын ",
        ]
    },
    {
        "question": "Суицидальные мысли",
        "answers": [
            "Мысли о самоубийстве меня не посещают",
            "У меня появляются мысли о самоубийстве, но я никогда не смогу этого сделать",
            "Я хотела бы покончить с собой",
            "Я бы убила себя, если бы представился случай"
        ],
        "answers_kz": [
            "Өз-өзіме қол жұмсау туралы ойлар маған келмейді",
            "Менде суицид туралы ойлар бар, бірақ мен оны ешқашан іске асыра алмаймын",
            "Мен өзіме қол жұмсағым келеді",
            "Егер мүмкіндігім болса өзіме қол жұмсар едім",
        ]
    },
    {
        "question": "Плаксивость",
        "answers": [
            "Я плачу не больше чем обычно",
            "Сейчас я плачу чаще, чем раньше",
            "Теперь я все время плачу",
            "Я хочу плакать, но не могу"
        ],
        "answers_kz": [
            "Мен әдеттегіден көп жыламаймын",
            "Қазір мен бұрынғыға қарағанда жиі жылаймын",
            "Мен үнемі жылаймын",
            "Жылағым келсе де, жылай алмаймын",
        ]
    },
    {
        "question": "Возбужденность",
        "answers": [
            "Я беспокойна или возбуждена не более, чем обычно",
            "Я чувствую себя более возбужденной, чем раньше",
            "Я так обеспокоена и возбуждена, что трудно оставаться на месте",
            "Я так обеспокоена и возбуждена, что должна продолжать двигаться или что-то делать"
        ],
        "answers_kz": [
            "Менің мазасыздануым мен толқуым әдеттегідей",
            "Мен бұрынғыдан гөрі жиірек толқып мазасызданамын",
            "Менің мазасызданып толқитыным соншалықты, бір орында ұзақ тұру мүмкін емес",
            "Менің мазасызданып толқитыным соншалықты, мен әрдайым қозғалыста болуым керек немесе үздіксіз  бір іспен айналысуым қажет"
        ]
    },
    {
        "question": "Потеря интереса",
        "answers": [
            "Я не потеряла интерес к другим людям или деятельности",
            "Я меньше интересуюсь другими людьми, чем раньше",
            "2 Я почти потеряла интерес к другим людям",
            "Я полностью утратила интерес к другим людям"
        ],
        "answers_kz": [
            "Мен басқа адамдарға немесе қызметіме деген қызығушылығымды жоғалтқан жоқпын",
            " Мен басқа адамдарға бұрынғыдан гөрі азырақ қызығушылық танытамын",
            "Мен басқа адамдарға деген қызығушылықты жоғалта бастадым",
            "Мен басқа адамдарға деген қызығушылықты мүлдем жоғалттым",
        ]
    },
    {
        question: 'Не решительность',
        answers: [
            'Я способна принимать решения так же, как всегда',
            'Мне труднее принимать решения, чем обычно',
            'Сейчас мне гораздо сложнее принять решение, чем раньше',
            'Я больше не могу принимать решения'
        ],
        "answers_kz": [
            "Мен әдеттегідей шешім қабылдай аламын",
            "Маған шешім қабылдау әдеттегіден қиын",
            "Маған шешім қабылдау бұрынғыға қарағанда әлдеқайда қиын ",
            "Мен шешім қабылдай алмаймын",
        ]
    },
    {
        question: 'Бесполезность',
        answers: [
            'Я не чувствую себя бесполезной',
            'Я не считаю себя стоящей и полезной, как раньше',
            'Я чувствую себя более бесполезной, по сравнению с другими людьми',
            'Я чувствую себя совершенно бесполезной'
        ],
        "answers_kz": [
            "Мен өзімді түкке тұрғысыз сезінбеймін",
            "Мен өзімді бұрынғыдай пайдалы деп санамаймын",
            "Басқа адамдармен салыстырғанда өзімді пайдасыз сезінемін",
            "Мен өзімді түкке тұрғысыз сезінемін",
        ]
    },
    {
        question: 'Потеря энергии',
        answers: [
            'Я всегда чувствую себя энергично',
            'У меня меньше энергии, чем раньше',
            'Я с большим трудом заставляю себя что-либо делать',
            'Я вообще не могу что-либо делать'
        ],
        "answers_kz": [
            "Мені өзімді үнем жігерлі сезінемін",
            "Менде бұрынғыға қарағанда энергия аз",
            "Бірдеңе жасау үшін маған өзімді  мәжбүрлеуге тура келеді",
            "Мен ештеңе істей алмаймын",
        ]
    },
    {
        question: 'Изменения в режиме сна',
        answers: [
            'Нет изменений в режиме сна',
            'Я сплю больше чем обычно или Я сплю меньше чем обычно',
            'Я сплю намного больше чем обычно или Я сплю намного меньше чем обычно',
            'Я сплю большую часть дня или Я просыпаюсь на 1-2 часа раньше и не могу снова заснуть'
        ],
        "answers_kz": [
            "Ұйқы тәртібінде өзгерістер жоқ",
            "Мен әдеттегіден көп ұйықтаймын немесе Мен әдеттегіден аз ұйықтаймын",
            "Мен әдеттегіден әлдеқайда көп ұйықтаймын немесе Мен әдеттегіден әлдеқайда аз ұйықтаймын",
            "Мен күннің көп бөлігін ұйықтаймын немесе Мен әдеттегіден 1-2 сағат бұрын оянып, қайтадан ұйықтай алмаймын",
        ]
    },
    {
        question: 'Раздражительность',
        answers: [
            'Я не более раздражительна, чем обычно',
            'Я более раздражительна, чем обычно',
            'Я намного раздражительна, чем обычно',
            'Я все время раздражена'
        ],
        "answers_kz": [
            "Мен әдеттегіден көп ашуланбаймын",
            "Мен әдеттегімен салыстырғанда ашуланшақпын",
            " Мен әдеттегімен салыстырғанда көбірек ашуланамын",
            "Мен үнемі ашуланшақпын",
        ]
    },
    {
        question: 'Изменения в аппетите',
        answers: [
            'Нет изменений в аппетите',
            'У меня меньше аппетита, чем обычно',
            'У меня больше аппетита, чем обычно',
            'У меня нет аппетита вообще или я постоянно чувствую голод'
        ],
        "answers_kz": [
            "Тәбетім өзгермеген немесе ",
            "Тәбетім біршама жоғарылады немесе Тәбетім аздап төмендеді",
            "Тәбетім айтарлықтай төмендеді немесе Тәбетім айтарлықтай жоғарылады",
            "Менің мүлдем тәбетім жоқ немесе Мен әрқашан тамақтанғым келіп тұрады",
        ]
    },
    {
        question: 'Концентрация и внимание',
        answers: [
            'Мое внимание и концентрация такие же, как всегда',
            'Мне труднее сконцентрироваться на чем-либо или удержать внимание',
            'Я почти не могу сосредоточиться ни на чем',
            'Мне кажется, что я совсем не могу сосредоточиться или удержать внимание ни на какое дело'
        ],
        "answers_kz": [
            "Менің бір нәрсеге назар аудару қабілетім әдеттегідей",
            "Менің бір нәрсеге назар аударуым әдеттегіге қарағанда нашар ",
            "Бір нәрсеге ұзақ уақыт бойы назар аударуым қиын",
            "Мен ештеңеге көңіл аудара алмаймын",
        ]
    },
    {
        question: 'Усталость',
        answers: [
            'Я устаю не больше, чем обычно',
            'Я устаю больше, чем обычно',
            'Я очень сильно устаю чтобы сделать большинство вещей, которые я раньше делала',
            'Я чувствую себя очень уставшей, чтобы что-либо делать'
        ],
        "answers_kz": [
            "Мен әдеттегіден көп шаршамаймын",
            "Мен әдеттегіден көп шаршаймын",
            "Мен бұрын жасап жүрген тірліктерден өте қатты шаршаймын",
            "Менің ешнәрсе қауқарым жоқ",
        ]
    },
    {
        question: 'Интерес к интимной близости',
        answers: [
            'Я не замечала каких-либо изменений в моих сексуальных интересах',
            'Меня интимная близость интересует меньше, чем обычно',
            'Меня интимная близость интересует намного меньше, чем обычно',
            'Я совершенно утратила интерес к интимной близости'
        ],
        "answers_kz": [
            "Менің жыныстық қатынақа қызығушылығымда ешқандай өзгеріс жоқ",
            "Мені жақындық әдеттегідей қызықтырмайды",
            "Мені жақындық әдеттегіден әлдеқайда аз қызықтырады",
            "Мен жақындыққа деген қызығушылығымды мүлдем жоғалттым",
        ]
    }
];
for (var i = 0; i < questionsDepression.length; i++) {
    db.getCollection("Option").insertMany([
        {
            text_ru: options[i]["answers"][0],
            text_kz: options[i]["answers_kz"][0],
            points: 0,
            questionId: questionsDepression[i]["_id"]
        },
        {
            text_ru: options[i]["answers"][1],
            text_kz: options[i]["answers_kz"][1],
            points: 1,
            questionId: questionsDepression[i]["_id"]
        },
        {
            text_ru: options[i]["answers"][2],
            text_kz: options[i]["answers_kz"][2],
            points: 2,
            questionId: questionsDepression[i]["_id"]
        },
        {
            text_ru: options[i]["answers"][3],
            text_kz: options[i]["answers_kz"][3],
            points: 3,
            questionId: questionsDepression[i]["_id"]
        }
    ]);
}
